/*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
* 文件名  ：key
* 作者    ：xuxinjie
* 版本    ：V0.0.1
* 时间    ：2020/10/25
* 描述    ：按键的驱动文件
********************************************************************
* 副本
*
*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>*/

/* 头文件 ----------------------------------------------------------------*/
#include<key.h>
/* 宏定义 ----------------------------------------------------------------*/
#define KEY1 P0_1
#define KEY2 P2_0
/* 结构体或枚举 ----------------------------------------------------------------*/
/* 内部函数声明 ----------------------------------------------------------------*/


/* 函数 ----------------------------------------------------------------*/
/*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
* 函数名  ：KeyInt
* 参数    ：void
* 返回    ：void
* 作者    ：xuxinjie
* 时间    ：2020/10/25
* 描述    ：按键I0的初始化
----------------------------------------------------------------*/
void  KeyInt(void)
{
  //设置成普通I0 P0SEL P2SEL
  P0SEL &= 0xFD;
  P2SEL &= 0xFE;
  
  //设置输入模式
  P0DIR &= 0xFD;
  P2DIR &= 0xFE;
  
  //设置上拉模式
  P0INP &=0xFD;
  P2INP &=0x5E;
}

/*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
* 函数名  ：KeyStateGet
* 参数    ：unsigned char ucKeyNum 1 KEY1序号 2 KEY2 序号
* 返回    ：unsigned char 1 松开 0 按下 255 错误
* 作者    ：xuxinjie
* 时间    ：2020/10/25
* 描述    ：获取按键状态
----------------------------------------------------------------*/
unsigned char KeyStateGet (unsigned char ucKeyNum)
{
  unsigned char ucKeyState;
  
  if(KEY1 == ucKeyNum)
  {
    ucKeyState = KEY_KEY1_E;
    
  }
  else if(KEY2 == ucKeyNum)
  {
    ucKeyState = KEY_KEY2_E;
    
  }
  else
  {
    ucKeyState = KEY_ERROR;
    
  }
  return ucKeyState;
  
}
